import random

deathCourse = ["窒息", "重伤", "失血", "病发", "中毒", "意外"]
data = {"现场位置": ["市区", "山区", "景区", "闹市", "郊区", "室内"],
        "案发地点": ["客厅", "房间", "仓库", "浴室", "厨房", "露台"],
        "面部表情": ["安详", "挣扎", "恐惧", "痛苦", "模糊", "其他"],
        "信息来源": ["声音", "动作", "味道", "影像", "触觉", "其他"],
        "凶手性格": ["傲慢", "卑鄙", "暴怒", "贪婪", "淫邪", "变态"],
        "作案动机": ["仇杀", "谋杀", "暗杀", "情杀", "误杀", "自杀"],
        "死亡时间": ["清晨", "上午", "中午", "下午", "傍晚", "午夜"],
        "遗留迹象": ["文字", "字母", "数字", "符号", "线段", "图形"],
        "死者衣着": ["整齐", "杂乱", "华丽", "破烂", "奇特", "裸体"],
        "尸体状况": ["余温", "僵硬", "腐烂", "残缺", "完整", "扭曲"],
        "死者体格": ["性感", "肥胖", "瘦弱", "高大", "瘦小", "畸形"],
        "突发状况": ["断电", "起火", "寻访", "失踪", "喊叫", "无"],
"案件性质":["一般","严重","离奇","残忍","悲惨","悬疑"],
"案件疑点":["头部","胸部","腿部","手部","背部","全身"],
"死亡时常":["瞬间","短暂","间断","漫长","数日","模糊"],
        }

manner = ['火柴', '绳索', '化学品', '电线', '药物', '铲子', '大麻', '铁片', '石头', '重物', '毒液', '奸杀', '疯狗', '纵火', '事故', '斧头', '密室', '电路', '农药', '利益', '砒霜', '软禁', '电钻', '割喉', '雕塑', '阴谋', '铜管', '欺辱', '载具', '手枪', '鞭子', '哑铃', '酒精', '狙击', '陷害', '高温', '毒气', '踢打', '煤气', '手术', '长剑', '竹签', '匕首', '剪刀', '猎枪', '砖块', '锤子', '工作', '溺水', '刑具', '棍棒', '铁丝', '炸药', '奖杯', '病毒', '毒品', '皮带', '菜刀']


clue = ['麻将', '记号', '油漆', '耳环', '薄膜', '弹簧', '杯子', '狗毛', '锁铐', '欠条', '纸巾', '床单', '提琴', '枕头', '灰尘', '项链', '棋子', '试管', '塑料', '请帖', '雨伞', '木屑', '纽扣', '杂志', '粉末', '鼠标', '毛线', '铁锁', '口哨', '抹布', '工具', '怀表', '子弹', '剧本', '衬衫', '雪茄', '拖鞋', '食物', '铃声', '粉笔', '台灯', '咖啡', '气味', '口罩', '字条', '相机', '发卡', '蚊香', '垃圾', '齿轮', '碎尸', '血液', '手机', '电器', '镜子', '针孔', '碎片', '录音', '画作', '字典', '磁盘', '球鞋', '电脑', '耳机', '瓶盖', '戒指']

random.shuffle(clue)
random.shuffle(manner)
long=[]
for key,val in data.items():
      long.append(key)
random.shuffle(long)

# print(list(set(manner)))
# print(list(set(clue)))
# print(len(manner),len(clue))

count=6
for i in range(1,count+1):
        print(f"第{i}名玩家的杀人方式：")
        print(",".join(manner[i*4-4:i*4]))
        print(f"第{i}名玩家的遗留线索：")
        print(",".join(clue[i * 4 - 4:i * 4]))

print("死因：")
print(deathCourse)

for i in range(4):
        print(long[i]+":")
        print(data[long[i]])


